// Libraries
import React from "react"
import { StaticImage } from "gatsby-plugin-image"

// Components
import TitleIcon from "../svg/TitleIcon"

function Culture() {
  return (
    <section className="culture" id="culture">
      <section className="container">
        <div className="title__wrapper">
          <h2 className="title__h2">Культура</h2>
          <div className="title__icon">
            <TitleIcon
              path={
                "M12 21c-.645-.572-1.374-1.167-2.145-1.8h-.01c-2.715-2.22-5.792-4.732-7.151-7.742-.446-.958-.683-2-.694-3.058A5.39 5.39 0 017.5 3a6.158 6.158 0 013.328.983A5.6 5.6 0 0112 5c.344-.39.738-.732 1.173-1.017A6.152 6.152 0 0116.5 3 5.39 5.39 0 0122 8.4a7.422 7.422 0 01-.694 3.063c-1.359 3.01-4.435 5.521-7.15 7.737l-.01.008c-.772.629-1.5 1.224-2.145 1.8L12 21zM7.5 5a3.535 3.535 0 00-2.5.992A3.342 3.342 0 004 8.4c.011.77.186 1.53.512 2.228A12.314 12.314 0 007.069 14.1c.991 1 2.131 1.968 3.117 2.782.273.225.551.452.829.679l.175.143c.267.218.543.444.81.666l.013-.012.006-.005h.006l.009-.007h.01l.018-.015.041-.033.007-.006.011-.008h.006l.009-.008.664-.545.174-.143c.281-.229.559-.456.832-.681.986-.814 2.127-1.781 3.118-2.786a12.298 12.298 0 002.557-3.471c.332-.704.51-1.471.52-2.25A3.343 3.343 0 0019 6a3.535 3.535 0 00-2.5-1 3.988 3.988 0 00-2.99 1.311L12 8.051l-1.51-1.74A3.988 3.988 0 007.5 5z"
              }
            />
          </div>
        </div>
      </section>
      <section className="culture__info">
        <section className="culture__content">
          <p className="article">
            Много кто говорит о работе в команде, но мало кто понимает, что это
            такое на самом деле. В ГК «Аркос» каждый сотрудник — по-настоящему
            важная частица одного большого рабочего процесса. Именно поэтому
            среди нас нет тех, кто выбивается из общего рабочего ритма и не
            понимает своей роли внутри компании. Благодаря вовлечённости, чётко
            регламентированным процессам и доступным каждому «дорожным картам»,
            понятие «командная работа» выходит на совершенно другой уровень.
          </p>
        </section>
        <StaticImage
          className="culture__img"
          src="../../images/culture.png"
          alt="culture"
          placeholder="tracedSVG"
        />
      </section>
    </section>
  )
}

export default Culture
